data/NASA_2DWMH_backup_before_promotion/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
180400
(
-1.34758937076
-1.34276794173
-1.33794642743
-1.33312499839
-1.32830356936
-1.32348214033
-1.31866071129
-1.31383928226
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
220
(
-1.35
-1.35
-1.35
-1.35
-1.35
-1.35
-1.35
-1.35
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
220
(
0.84
0.84
0.84
0.84
0.84
0.84
0.84
0.84
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
820
(
-1.34758928572
-1.34276785714
-1.33794642858
-1.333125
-1.32830357142
-1.32348214285
-1.31866071428
-1.31383928571
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
820
(
-1.34780998998
-1.34298736832
-1.33794344586
-1.33312082421
-1.32829820256
-1.3234755809
-1.31865295925
-1.31383033759
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
