data/NASA_2DWMH_backup_before_promotion/system/residuals
type            residuals;
libs            ("libutilityFunctionObjects.so");
writeControl    timeStep;
writeInterval   1;

#include "../fieldDef"

fields          $residualFields;
